---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationItemFolder Properties
FabricationItemFolder Class See Also Send Feedback
---

The FabricationItemFolder type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The item folder's name. |

# See Also

FabricationItemFolder Class

Autodesk.Revit.DB Namespace